### 1

In [1]:
import pandas as pd

In [4]:
a = {
    "author_id": [1, 2, 3],
    "author_name": ["Тургенев", "Чехов", "Островский"]
}
authors = pd.DataFrame(a)
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [13]:
b = {
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],

    "price":  [20, 100, 50, 10, 30, 90, 75]
}

book = pd.DataFrame(b)
book

   author_id            book_title  price
0          1           Отцы и дети     20
1          1                 Рудин    100
2          1     Дворянское гнездо     50
3          2      Толстый и тонкий     10
4          2       Дама с собачкой     30
5          3                 Гроза     90
6          3  Таланты и поклонники     75

### 2

In [14]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети     20
1          1    Тургенев                 Рудин    100
2          1    Тургенев     Дворянское гнездо     50
3          2       Чехов      Толстый и тонкий     10
4          2       Чехов       Дама с собачкой     30
5          3  Островский                 Гроза     90
6          3  Островский  Таланты и поклонники     75

### 3

In [24]:
top_5 = authors_price.sort_values(by="price", inplace=False)
top_5.tail()

   author_id author_name            book_title  price
4          2       Чехов       Дама с собачкой     30
2          1    Тургенев     Дворянское гнездо     50
6          3  Островский  Таланты и поклонники     75
5          3  Островский                 Гроза     90
1          1    Тургенев                 Рудин    100

### 4

In [28]:
authors_stat = authors_price.agg({"price": "max"})
authors_stat

price    100
dtype: int64